; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v4 ?v12)
             (pred_8 ?v13 ?v1)
             (pred_11 ?v4 ?v1)
             (pred_6 ?v6 ?v4 )
	     (pred_12 ?v4)
             (pred_7 ?v5)
             (pred_10 ?v13)
             (pred_1 ?v1)
             (pred_3 ?v4)
             (pred_5 ?v13)
             (pred_9 ?v4)
             (pred_2 ))



(:action op_5
:parameters (?v11 ?v2 ?v3 ?v8)
:precondition (and (pred_7 ?v11) (pred_7 ?v2) (pred_10 ?v3) (pred_1 ?v8)
          (pred_4 ?v11 ?v2) (pred_8 ?v3 ?v8)
                   (pred_11 ?v2 ?v8) (pred_12 ?v11) 
                   (pred_3 ?v2) (pred_5 ?v3))
:effect (and  (pred_9 ?v2) (not (pred_3 ?v2))))


(:action op_2
:parameters (?v11 ?v7)
:precondition (and (pred_7 ?v11) (pred_7 ?v7)
               (pred_12 ?v11) (pred_4 ?v11 ?v7) (pred_9 ?v7))
:effect (and (pred_12 ?v7) (not (pred_12 ?v11))))

(:action op_4
:parameters (?v11 ?v3)
:precondition (and (pred_7 ?v11) (pred_10 ?v3) 
                  (pred_12 ?v11) (pred_6 ?v3 ?v11) (pred_2 ))
:effect (and (pred_5 ?v3)
   (not (pred_6 ?v3 ?v11)) (not (pred_2 ))))


(:action op_3
:parameters (?v11 ?v9 ?v10)
:precondition (and (pred_7 ?v11) (pred_10 ?v9) (pred_10 ?v10)
                  (pred_12 ?v11) (pred_5 ?v10) (pred_6 ?v9 ?v11))
:effect (and (pred_5 ?v9) (pred_6 ?v10 ?v11)
        (not (pred_5 ?v10)) (not (pred_6 ?v9 ?v11))))

(:action op_1
:parameters (?v11 ?v3)
:precondition (and (pred_7 ?v11) (pred_10 ?v3) 
                  (pred_12 ?v11) (pred_5 ?v3))
:effect (and (pred_2 ) (pred_6 ?v3 ?v11) (not (pred_5 ?v3)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_02 obj_10 obj_04 obj_08 obj_01 obj_12 obj_09 obj_07 obj_13
    obj_03 obj_11
    obj_05 obj_06
    )

    (:init
       (pred_2)

       (pred_7 obj_02)
       (pred_7 obj_10)
       (pred_7 obj_04)
       (pred_7 obj_08)
       (pred_7 obj_01)
       (pred_7 obj_12)
       (pred_7 obj_09)
       (pred_7 obj_07)
       (pred_7 obj_13)
       (pred_1 obj_03)
       (pred_1 obj_11)
       (pred_10 obj_05)
       (pred_10 obj_06)

       (pred_4 obj_02 obj_08)
       (pred_4 obj_02 obj_10)
       (pred_4 obj_10 obj_01)
       (pred_4 obj_10 obj_04)
       (pred_4 obj_10 obj_02)
       (pred_4 obj_04 obj_12)
       (pred_4 obj_04 obj_10)
       (pred_4 obj_08 obj_09)
       (pred_4 obj_08 obj_01)
       (pred_4 obj_08 obj_02)
       (pred_4 obj_01 obj_07)
       (pred_4 obj_01 obj_12)
       (pred_4 obj_01 obj_10)
       (pred_4 obj_01 obj_08)
       (pred_4 obj_12 obj_13)
       (pred_4 obj_12 obj_04)
       (pred_4 obj_12 obj_01)
       (pred_4 obj_09 obj_07)
       (pred_4 obj_09 obj_08)
       (pred_4 obj_07 obj_13)
       (pred_4 obj_07 obj_01)
       (pred_4 obj_07 obj_09)
       (pred_4 obj_13 obj_12)
       (pred_4 obj_13 obj_07)
       (pred_3 obj_04)
       (pred_3 obj_13)
       (pred_11  obj_04 obj_03)
       (pred_11  obj_13 obj_11)
       (pred_9 obj_02)
       (pred_9 obj_10)
       (pred_9 obj_08)
       (pred_9 obj_01)
       (pred_9 obj_12)
       (pred_9 obj_09)
       (pred_9 obj_07)

       (pred_8  obj_05 obj_03)
       (pred_8  obj_06 obj_11)
       (pred_6 obj_05 obj_08)
       (pred_6 obj_06 obj_02)
       (pred_12 obj_01)
    )

    (:goal (and
       (pred_6 obj_06 obj_13)
    ))
(:constraints
  (always (not (pred_12 obj_10)))
)
)

; plan
1. (op_2 obj_01 obj_08)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_08)
   goals met: 0 of 1
2. (op_2 obj_08 obj_02)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_02)
   goals met: 0 of 1
3. (op_4 obj_02 obj_06)
   deleted: (pred_6 obj_06 obj_02) (pred_2)
   added: (pred_5 obj_06)
   goals met: 0 of 1
4. (op_2 obj_02 obj_08)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_08)
   goals met: 0 of 1
5. (op_2 obj_08 obj_01)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_01)
   goals met: 0 of 1
6. (op_2 obj_01 obj_12)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_12)
   goals met: 0 of 1
7. (op_5 obj_12 obj_13 obj_06 obj_11)
   deleted: (pred_3 obj_13)
   added: (pred_9 obj_13)
   goals met: 0 of 1
8. (op_2 obj_12 obj_13)
   deleted: (pred_12 obj_12)
   added: (pred_12 obj_13)
   goals met: 0 of 1
9. (op_1 obj_13 obj_06)
   deleted: (pred_5 obj_06)
   added: (pred_2) (pred_6 obj_06 obj_13)
   goals met: 1 of 1
